# <h2 align="center" id="heading">DESAFIO TRES: <b>PANDAS Y SERIES DE TIEMPO</b></h2>
## **Alumno:** Ariel Arias

## Ejercicio 1
Construir un objeto de series de tiempo con el índice igual al año de los juegos olímpicos

Vamos a trabajar con un archivo CSV; el archivo está disponible en este [link][csvfile]  para poder validar los resultados del ejercicio.

[csvfile]: https://drive.google.com/file/d/1F3L_igH1kJ_Rx44rKRjRVAtrPMulYRsY/view?usp=sharing

In [1]:
import pandas as pd

In [2]:
dfurl = 'https://drive.google.com/file/d/1F3L_igH1kJ_Rx44rKRjRVAtrPMulYRsY/view?usp=sharing'
url2 = 'https://drive.google.com/uc?id=' + dfurl.split('/')[-2]
print(url2)
# df = pd.read_csv(url2, encoding='latin1')

In [3]:
# En caso de no tener acceso al archivo por Internet
# descomentar esta lectura directa; 
# antes, asegurarse de tener el archivo en el mismo directorio de este notebook
## df = pd.read_csv("Olympicmedals-1976-to-2008CSV.csv", encoding = "UTF-8", delimiter = ";", header=0)

In [4]:
# Para validar la correcta lectura de los datos:
df

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976.0,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976.0,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976.0,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976.0,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976.0,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze
...,...,...,...,...,...,...,...,...,...,...,...
15428,Beijing,2008.0,Wrestling,Wrestling Gre-R,66 - 74kg,"GUENOT, Christophe",Men,FRA,France,M,Bronze
15429,Beijing,2008.0,Wrestling,Wrestling Gre-R,66 - 74kg,"KVIRKELIA, Manuchar",Men,GEO,Georgia,M,Gold
15430,Beijing,2008.0,Wrestling,Wrestling Gre-R,55 - 60kg,"RAHIMOV, Vitaliy",Men,AZE,Azerbaijan,M,Silver
15431,Beijing,2008.0,Wrestling,Wrestling Gre-R,60 - 66kg,"GUENOT, Steeve",Men,FRA,France,M,Gold
15432,Beijing,2008.0,Wrestling,Wrestling Gre-R,96 - 120kg,"LOPEZ, Mijain",Men,CUB,Cuba,M,Gold

In [5]:
# Para Conocer los nombres de las columnas y poder referirlas 
df.columns

Index(['City', 'Year', 'Sport', 'Discipline', 'Event', 'Athlete', 'Gender',
       'Country_Code', 'Country', 'Event_gender', 'Medal'],
      dtype='object')

In [6]:
df['Year']

0        1976.0
1        1976.0
2        1976.0
3        1976.0
4        1976.0
          ...
15428    2008.0
15429    2008.0
15430    2008.0
15431    2008.0
15432    2008.0
Name: Year, Length: 15433, dtype: float64

In [7]:
# Antes de crear el indice de años, vamos a asegurarnos de eliminar registros nulos:
df.dropna(subset=['Year'], inplace=True)

In [8]:
# Sabemos que los valores están como "float", vamos a pasarlos a Enteros:
df['Year'] = df['Year'].astype(int)

In [9]:
# Validamos el resultado:
df['Year']

0        1976
1        1976
2        1976
3        1976
4        1976
         ...
15428    2008
15429    2008
15430    2008
15431    2008
15432    2008
Name: Year, Length: 15316, dtype: int64

In [10]:
# Vamos a pasar la columna Year a formato Fecha:
df['Year'] = pd.to_datetime(df['Year'], format='%Y')

In [11]:
# Una vez más, verificamos el resultado:
df['Year']

0       1976-01-01
1       1976-01-01
2       1976-01-01
3       1976-01-01
4       1976-01-01
           ...
15428   2008-01-01
15429   2008-01-01
15430   2008-01-01
15431   2008-01-01
15432   2008-01-01
Name: Year, Length: 15316, dtype: datetime64[ns]

## Objeto Series de Tiempo

In [12]:
# Indexamos el DataFrame por el Año
pd.DatetimeIndex(df['Year']).year

Int64Index([1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976,
            ...
            2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008],
           dtype='int64', name='Year', length=15316)

In [13]:
# Copiamos el Indice a un nuevo objeto:
indice_year = pd.DatetimeIndex(df['Year']).year
indice_year

Int64Index([1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976, 1976,
            ...
            2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008, 2008],
           dtype='int64', name='Year', length=15316)

In [14]:
# Comprobamos poder usar el objeto para analizar el DataFrame.
# Por ejemplo, el país que ganó medallas cada año:
Serie_medallas = pd.Series(df['Country'].values,index=indice_year)
Serie_medallas

Year
1976     East Germany
1976     Soviet Union
1976    United States
1976            Italy
1976    United States
            ...
2008           France
2008          Georgia
2008       Azerbaijan
2008           France
2008             Cuba
Length: 15316, dtype: object

In [15]:
# O filtramos.
# Por ejemplo, el país que ganó medallas desde el año 2000 (inclusive):
filtro = (Serie_medallas.index >= 2000)
Serie_medallas[filtro]

Year
2000            China
2000        Australia
2000           Russia
2000        Australia
2000    United States
            ...
2008           France
2008          Georgia
2008       Azerbaijan
2008           France
2008             Cuba
Length: 6055, dtype: object

## Ejercicio 2
Separar nombres de apellidos en dos columnas distintas usando la coma como separador.

Vamos a utilizar la función "split"

In [16]:
# Revisamos el contenido de la columna que contiene los nombres.
# Sabemos que es la columna: Athlete
df['Athlete']

0                 KÖHLER, Christa
1             KOSENKOV, Aleksandr
2            BOGGS, Philip George
3        CAGNOTTO, Giorgio Franco
4          WILSON, Deborah Keplar
                   ...
15428          GUENOT, Christophe
15429         KVIRKELIA, Manuchar
15430            RAHIMOV, Vitaliy
15431              GUENOT, Steeve
15432               LOPEZ, Mijain
Name: Athlete, Length: 15316, dtype: object

In [17]:
# Se ve que en efecto hay 1 coma, entonces, podemos separar directamente en dos columnas:
df['Athlete'].str.split()

0                  [KÖHLER,, Christa]
1              [KOSENKOV,, Aleksandr]
2            [BOGGS,, Philip, George]
3        [CAGNOTTO,, Giorgio, Franco]
4          [WILSON,, Deborah, Keplar]
                     ...
15428           [GUENOT,, Christophe]
15429          [KVIRKELIA,, Manuchar]
15430             [RAHIMOV,, Vitaliy]
15431               [GUENOT,, Steeve]
15432                [LOPEZ,, Mijain]
Name: Athlete, Length: 15316, dtype: object

In [18]:
# Usar sólo "split" no hace lo solicitado, necesitamos que sean dos columnas.
# Usamos los parámetros de la función para indicar que el separador es la coma (,).
# Para analizar el resultado, usaremos además el parámetro "expand" para saber cuántas columnas
# va a generar:
df['Athlete'].str.split(',',expand=True)

               0                1     2
0         KÖHLER          Christa  None
1       KOSENKOV        Aleksandr  None
2          BOGGS    Philip George  None
3       CAGNOTTO   Giorgio Franco  None
4         WILSON   Deborah Keplar  None
...          ...              ...   ...
15428     GUENOT       Christophe  None
15429  KVIRKELIA         Manuchar  None
15430    RAHIMOV          Vitaliy  None
15431     GUENOT           Steeve  None
15432      LOPEZ           Mijain  None

[15316 rows x 3 columns]

In [19]:
# Vemos que hay datos con más de una coma en el valor, por lo que podemos tener problemas.
# Utilizaremos además el parámetro para indicar el máximo de columnas que queremos: 1
# Recordar que Python inicia a contar en 0
df['Athlete'].str.split(',',1,expand=True)

               0                1
0         KÖHLER          Christa
1       KOSENKOV        Aleksandr
2          BOGGS    Philip George
3       CAGNOTTO   Giorgio Franco
4         WILSON   Deborah Keplar
...          ...              ...
15428     GUENOT       Christophe
15429  KVIRKELIA         Manuchar
15430    RAHIMOV          Vitaliy
15431     GUENOT           Steeve
15432      LOPEZ           Mijain

[15316 rows x 2 columns]

In [20]:
# aún no se modificó nuestro Data Frame:
df['Athlete']

0                 KÖHLER, Christa
1             KOSENKOV, Aleksandr
2            BOGGS, Philip George
3        CAGNOTTO, Giorgio Franco
4          WILSON, Deborah Keplar
                   ...
15428          GUENOT, Christophe
15429         KVIRKELIA, Manuchar
15430            RAHIMOV, Vitaliy
15431              GUENOT, Steeve
15432               LOPEZ, Mijain
Name: Athlete, Length: 15316, dtype: object

In [21]:
# Vamos a invocar la misma función pero esta vez lo pasaremos al mismo arreglo.
# Nombraremos las columnas con el valor apropiado además.
# Agregamos el parámetro "expand" como Verdadero:
df[['familyname','given']] = df['Athlete'].str.split(',',1,expand=True)

In [22]:
df.columns

Index(['City', 'Year', 'Sport', 'Discipline', 'Event', 'Athlete', 'Gender',
       'Country_Code', 'Country', 'Event_gender', 'Medal', 'familyname',
       'given'],
      dtype='object')

In [23]:
# Vemos cómo quedó el arreglo con las columnas de nombre y apellido
df

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal,familyname,given
0,Montreal,1976-01-01,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver,KÖHLER,Christa
1,Montreal,1976-01-01,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze,KOSENKOV,Aleksandr
2,Montreal,1976-01-01,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold,BOGGS,Philip George
3,Montreal,1976-01-01,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver,CAGNOTTO,Giorgio Franco
4,Montreal,1976-01-01,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze,WILSON,Deborah Keplar
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15428,Beijing,2008-01-01,Wrestling,Wrestling Gre-R,66 - 74kg,"GUENOT, Christophe",Men,FRA,France,M,Bronze,GUENOT,Christophe
15429,Beijing,2008-01-01,Wrestling,Wrestling Gre-R,66 - 74kg,"KVIRKELIA, Manuchar",Men,GEO,Georgia,M,Gold,KVIRKELIA,Manuchar
15430,Beijing,2008-01-01,Wrestling,Wrestling Gre-R,55 - 60kg,"RAHIMOV, Vitaliy",Men,AZE,Azerbaijan,M,Silver,RAHIMOV,Vitaliy
15431,Beijing,2008-01-01,Wrestling,Wrestling Gre-R,60 - 66kg,"GUENOT, Steeve",Men,FRA,France,M,Gold,GUENOT,Steeve
15432,Beijing,2008-01-01,Wrestling,Wrestling Gre-R,96 - 120kg,"LOPEZ, Mijain",Men,CUB,Cuba,M,Gold,LOPEZ,Mijain

## Ejercicio 3
Obtener medidas resumen del conjunto de datos. Cuál es el país que ganó más medallas?

In [24]:
# vamos a generar una serie que contendrá el número de medallas por país:
medallasporpais = df.groupby('Country')['Medal'].count()
medallasporpais

Country
Afghanistan          1
Algeria             14
Argentina          153
Armenia              9
Australia          798
                  ...
Virgin Islands*      1
West Germany       345
Yugoslavia         278
Zambia               2
Zimbabwe            23
Name: Medal, Length: 127, dtype: int64

In [25]:
# Queremos saber el que más medallas obtuvo, por lo tanto usaremos la función MAX:
maxmedallas = medallasporpais.idxmax()
print("El país que más medallas ha obtenido es ",maxmedallas)

El país que más medallas ha obtenido es  United States

In [26]:
# Pero, ¿Cuántas medallas obtuvo?
maxmedallascount = medallasporpais.get(maxmedallas)
print("El país que más medallas ha obtenido es ",maxmedallas, "con un total de ", maxmedallascount, "medallas")

El país que más medallas ha obtenido es  United States con un total de  1992 medallas

In [27]:
# Y el que menos obtuvo?:
minmedallas = medallasporpais.idxmin()
print("El país que menos medallas ha obtenido es "+ str(minmedallas), " con ", medallasporpais.get(minmedallas))

El país que menos medallas ha obtenido es Afghanistan  con  1

## Ejercicio 4
Construir una tabla que muestre cuántas medallas obtuvieron los hombres en total en cada año que se realizó el evento.

In [28]:
# Generamos una serie que agrupe por año y género, filtrando en seguida por Hombres
hombres_byyear = df.groupby(["Year", "Gender"]).filter(lambda x: any(x['Gender'] == 'Men'))

In [29]:
# Modificamos la serie para totalizar las medallas por año
hombres_byyear = hombres_byyear.groupby("Year")['Medal'].count()
hombres_byyear

Year
1976-01-01     924
1980-01-01     958
1984-01-01     973
1988-01-01    1011
1992-01-01    1105
1996-01-01    1082
2000-01-01    1126
2004-01-01    1099
2008-01-01    1110
Name: Medal, dtype: int64

In [30]:
# Sólo para validar, generamos otro arreglo que muestra medallas por año y Género
# Sin filtrar, es decir hombres y mujeres.
medallashombres = df.groupby(["Year", "Gender"])['Medal'].count()
medallashombres

Year        Gender
1976-01-01  Men        924
            Women      381
1980-01-01  Men        958
            Women      429
1984-01-01  Men        973
            Women      486
1988-01-01  Men       1011
            Women      535
1992-01-01  Men       1105
            Women      600
1996-01-01  Men       1082
            Women      777
2000-01-01  Men       1126
            Women      889
2004-01-01  Men       1099
            Women      899
2008-01-01  Men       1110
            Women      932
Name: Medal, dtype: int64